comparison_results/results-perf-producer-flood.txt
2020004 records sent, 404000.8 records/sec (197.27 MB/sec), 40.6 ms avg latency, 183.0 ms max latency.
1626125 records sent, 324965.0 records/sec (158.67 MB/sec), 7.5 ms avg latency, 49.0 ms max latency.
5000000 records sent, 359195.402299 records/sec (175.39 MB/sec), 20.56 ms avg latency, 183.00 ms max latency, 7 ms 50th, 92 ms 95th, 111 ms 99th, 118 ms 99.9th.